<a id='start'></a>
# Esercizi Clustering e anomaly detection

In questo notebook vengono presentati degli esercizi sui Decision Tree.

Provate a svolgere il seguente esercizio:<br>
1) [Cluster e elbow method](#section1)<br>
2) [Segmentazione delle specie](#section2)<br>
3) [Chicchi di frumento](#section3)<br>
4) [Vendite ti pesce gatto](#section4)<br>

<a id='section1'></a>
## Cluster e elbow method

Proviamo a predere un dataset con tutti i paesi e la loro latitudine e longitudine e a effettuarne una clusterizzazione:

In [1]:
import pandas as pd
data = pd.read_csv('data/Countries-exercise.csv')
data.head()

          name  Longitude   Latitude
0        Aruba -69.982677  12.520880
1  Afghanistan  66.004734  33.835231
2       Angola  17.537368 -12.293361
3     Anguilla -63.064989  18.223959
4      Albania  20.049834  41.142450

<a id='section2'></a>
## Segmentazione delle specie

Per questo esercizio utilizzeremo l'Iris flower dataset, che è uno dei dataset più popolari per gli esercizi di machine learning. Puoi leggere molte informazioni a riguardo a questo link: https://en.wikipedia.org/wiki/Iris_flower_data_set

In questo dataset ci sono 4 feature: sepal length, sepal width, petal length, and petal width.

Prova a disegnare i dati con 2, 3 e 5 cluster. Cosa osservi?

Prova a identificare il numero ottimale di cluster e poi calcolalo col metodo elbow.

<a id='section3'></a>
## Chicchi di frumento

Leggiamo il dataset che contiene misurazioni delle proprietà geometriche di chicchi appartenenti a tre diverse varietà di frumento. Una tecnica a raggi X morbidi e un pacchetto GRAINS sono stati utilizzati per costruire tutti e sette gli attributi a valore reale.

Proviamo a clusterizzare questo dataset con i 2 metodi visti: KMeans e DBScan.

In [1]:
import pandas as pd
import numpy as np

dataframe = pd.read_csv('data/seeds_dataset.txt',
                        header = None, 
                        sep = "\t",
                        on_bad_lines='skip', 
                        usecols = range(7)
                       )

dataframe.columns = ["AREA", "PERIMETER", "COMPACTNESS", "LENGTH", "WIDTH", "ASYMMETRY", "GROOVE_LENGTH"] 

dataframe.head()

    AREA  PERIMETER  COMPACTNESS  LENGTH  WIDTH  ASYMMETRY  GROOVE_LENGTH
0  15.26      14.84       0.8710   5.763  3.312      2.221          5.220
1  14.88      14.57       0.8811   5.554  3.333      1.018          4.956
2  14.29      14.09       0.9050   5.291  3.337      2.699          4.825
3  13.84      13.94       0.8955   5.324  3.379      2.259          4.805
4  16.14      14.99       0.9034   5.658  3.562      1.355          5.175

<a id='section4'></a>
## Vendite di pesce gatto

Importiamo il set di dati contenente le vendite di pesce gatto dal 1986 al 2001.
Usiamo quindi degli algoritmi per identificare eventuali anomalie nelle vendite.

In [1]:
import pandas as pd
dataset = pd.read_csv('data/catfish_sales_1986_2001.csv', parse_dates=[0])
dataset

          Date  Total
0   1986-01-01   9034
1   1986-02-01   9596
2   1986-03-01  10558
3   1986-04-01   9002
4   1986-05-01   9239
..         ...    ...
319 2012-08-01  14442
320 2012-09-01  34722
321 2012-10-01  13795
322 2012-11-01  13352
323 2012-12-01  12716

[324 rows x 2 columns]

[Clicca qui per tornare all'inizio della pagina](#start)<a id='start'></a>